Catalogs/НоменклатураСплитТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НоменклатураСплитТестирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсторияИзмененияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияРеквизитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеБыло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтало</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураСплитТестирования</v8:Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыПартнерскихБонусныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АссортиментСплитТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АссортиментСплитТестирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавлен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НоменклатураСплитТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураСплитТестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТоварныйАссортиментТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТоварныйАссортиментТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрещена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>id_TT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзПотерянных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НоменклатураСплитТестирования/Ext/ObjectModule.bsl
Перем ИсторияИзмененияРеквизитов; //+++АК SHEP 2018.10.26 ИП-00019584: сохраняем историю изменения реквизитов

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование = Строка(Номенклатура) + " (" + Строка(ХарактеристикаНоменклатуры) + ")";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ Тогда
		ИсторияИзмененияРеквизитов = РегистрыСведений.ИсторияИзмененияРеквизитов.ЗаполнитьДанныеДляИстории(ЭтотОбъект, "Отключена");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;	
	
	Если НЕ Отказ И ИсторияИзмененияРеквизитов.Количество() > 0 Тогда
		РегистрыСведений.ИсторияИзмененияРеквизитов.ЗаписатьИсторию(Ссылка, ИсторияИзмененияРеквизитов);
		
		// если отключили, должна возвращать товар в магазины, из которых убрала; убирать из магазинов, в которые добавила.
		Если ЭтотОбъект.Отключена Тогда
			 ВернутьАссортиментМагазинов();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВернутьАссортиментМагазинов()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		//|	АссортиментСплитТестирования.НоменклатураСплитТестирования,
		|	АссортиментСплитТестирования.ТорговаяТочка,
		|	СУММА(АссортиментСплитТестирования.Добавлен) КАК Добавлен
		|ИЗ
		|	РегистрСведений.АссортиментСплитТестирования КАК АссортиментСплитТестирования
		|ГДЕ
		|	АссортиментСплитТестирования.НоменклатураСплитТестирования = &НоменклатураСплитТестирования
		|
		|СГРУППИРОВАТЬ ПО
		|	АссортиментСплитТестирования.НоменклатураСплитТестирования,
		|	АссортиментСплитТестирования.ТорговаяТочка
		|
		|ИМЕЮЩИЕ
		|	СУММА(АссортиментСплитТестирования.Добавлен) <> 0");
	Запрос.УстановитьПараметр("НоменклатураСплитТестирования", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат; КонецЕсли;
	
	ДатаЗаписиРС = НачалоДня(ТекущаяДата());
	МенеджерЗаписиТАТ = РегистрыСведений.ТоварныйАссортиментТочек.СоздатьМенеджерЗаписи();
	МенеджерЗаписиАСТ = РегистрыСведений.АссортиментСплитТестирования.СоздатьМенеджерЗаписи();
	
	СтруктураОтбор = Новый Структура("Период,Номенклатура,Характеристика,НоменклатураСплитТестирования", ДатаЗаписиРС, Номенклатура, ХарактеристикаНоменклатуры, Ссылка);
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ДобавленаТТ = ВыборкаЗапроса.Добавлен;
		ТекТорговаяТочка = ВыборкаЗапроса.ТорговаяТочка;
		СтруктураОтбор.Вставить("ТорговаяТочка", ТекТорговаяТочка);
		
		// возвращаем ТоварныйАссортиментТочек
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиТАТ, СтруктураОтбор);
		МенеджерЗаписиТАТ.Прочитать();
		
		Если НЕ МенеджерЗаписиТАТ.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиТАТ, СтруктураОтбор);
		КонецЕсли;
		
		Если ДобавленаТТ > 0 Тогда
			МенеджерЗаписиТАТ.Выведена = Истина;
			МенеджерЗаписиТАТ.Комментарий = "Сплит-тестирование товаров: убрали добавленный ассортимент";
		Иначе
			МенеджерЗаписиТАТ.Выведена = Ложь;
			МенеджерЗаписиТАТ.Комментарий = "Сплит-тестирование товаров: вернули удалённый ассортимент";
		КонецЕсли;
		
		МенеджерЗаписиТАТ.Записать();
		
		// возвращаем АссортиментСплитТестирования
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиАСТ, СтруктураОтбор);
		МенеджерЗаписиАСТ.Прочитать();
		
		Если НЕ МенеджерЗаписиАСТ.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиАСТ, СтруктураОтбор);
		КонецЕсли;
		
		МенеджерЗаписиАСТ.Добавлен = -ДобавленаТТ;
		
		МенеджерЗаписиАСТ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
